{
  "metadata": {
    "title": "Binaries",
    "release_date": "2022-01-10T00:00:00+00:00",
    "description": "Bugcrowd iOS testing methodology",
    "vrt_version": "10.0.1"
  },
  "content": {
    "steps": [
      {
        "key": "architecture_design_and_threat_modelling",
        "title": "Architecture, design and threat modelling",
        "description": "",
        "type": "checklist",
        "items": [
          {
            "key": "all_app_components_are_identified_and_known_to_be_needed",
            "title": "All app components are identified and known to be needed",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "security_controls_client_side",
            "title": "Security controls are never enforced only on the client side, but on the respective remote endpoints.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "high_level_architecture_for_mobile_app",
            "title": "A high-level architecture for the mobile app and all connected remote services has been defined and security has been addressed in that architecture.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "sensitive_identified_data",
            "title": "Data considered sensitive in the context of the mobile app is clearly identified.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "business_and_security_functions",
            "title": "All app components are defined in terms of the business functions and/or security functions they provide.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "threat_model_for_mobile_app",
            "title": "A threat model for the mobile app and the associated remote services has been produced that identifies potential threats and countermeasures.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "security_controls",
            "title": "All security controls have a centralized implementation.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "cryptographic_key_policy",
            "title": "There is an explicit policy for how cryptographic keys (if any) are managed, and the lifecycle of cryptographic keys is enforced. Ideally, follow a key management standard such as NIST SP 800-57.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "enforce_mobile_app_updates",
            "title": "A mechanism for enforcing updates of the mobile app exists.",
            "caption": "Architecture, design and threat modelling"
          },
          {
            "key": "address_security",
            "title": "Security is addressed within all parts of the software development lifecycle.",
            "caption": "Architecture, design and threat modelling"
          }
        ]
      },
      {
        "key": "data_storage_and_privacy",
        "title": "Data Storage and Privacy",
        "type": "checklist",
        "items": [
          {
            "key": "system_creentials_storage_facilities",
            "title": "System credential storage facilities are used appropriately to store sensitive data, such as PII, user credentials or cryptographic keys."
          },
          {
            "key": "sensitive_data_storage",
            "title": "No sensitive data should be stored outside of the app container or system credential storage facilities."
          },
          {
            "key": "sensitive_data_in_logs",
            "title": "No sensitive data is written to application logs."
          },
          {
            "key": "sensitive_data_sharing_with_third_party",
            "title": "No sensitive data is shared with third parties unless it is a necessary part of the architecture."
          },
          {
            "key": "keyboard_cache_disabling",
            "title": "The keyboard cache is disabled on text inputs that process sensitive data.",
            "caption": "Testing Whether the Keyboard Cache Is Disabled for Text Input Fields"
          },
          {
            "key": "sensitive_data_ipc_mechanism",
            "title": "No sensitive data is exposed via IPC mechanisms."
          },
          {
            "key": "sensitive_data_exposure_via_ui",
            "title": "No sensitive data, such as passwords or pins, is exposed through the user interface.",
            "caption": "Testing for Sensitive Data Disclosure Through the User Interface"
          },
          {
            "key": "sensitive_data_exposure_via_backup",
            "title": "No sensitive data is included in backups generated by the mobile operating system."
          },
          {
            "key": "sensitive_data_removal_on_backgrounded",
            "title": "The app removes sensitive data from views when backgrounded.",
            "caption": "Testing for Sensitive Information in Auto-Generated Screenshots"
          },
          {
            "key": "sensitive_data_holding_in_memory",
            "title": "The app does not hold sensitive data in memory longer than necessary, and memory is cleared explicitly after use."
          },
          {
            "key": "minimum_device_access_security_policy",
            "title": "The app enforces a minimum device-access-security policy, such as requiring the user to set a device passcode."
          },
          {
            "key": "personal_identifiable_information_identification",
            "title": "The app educates the user about the types of personally identifiable information processed, as well as security best practices the user should follow in using the app."
          }
        ]
      },
      {
        "key": "cryptography",
        "title": "Cryptography",
        "type": "checklist",
        "items": [
          {
            "key": "symmetric_cryptography_with_hardcoded_keys",
            "title": "The app does not rely on symmetric cryptography with hardcoded keys as a sole method of encryption."
          },
          {
            "key": "proven_cryptographic_primitives",
            "title": "The app uses proven implementations of cryptographic primitives."
          },
          {
            "key": "cryptographic_primitive_for_particular_use_case",
            "title": "The app uses cryptographic primitives that are appropriate for the particular use-case, configured with parameters that adhere to industry best practices."
          },
          {
            "key": "depricated_cryptography_protocols",
            "title": "The app does not use cryptographic protocols or algorithms that are widely considered depreciated for security purposes."
          },
          {
            "key": "reuse_same_cryptographic_key",
            "title": "The app doesn't re-use the same cryptographic key for multiple purposes."
          },
          {
            "key": "secure_random_number_generator",
            "title": "All random values are generated using a sufficiently secure random number generator."
          }
        ]
      },
      {
        "key": "authentication_and_session_management",
        "title": "Authentication and Session Management",
        "type": "checklist",
        "items": [
          {
            "key": "remote_service_authentication",
            "title": "If the app provides users access to a remote service, some form of authentication, such as username/password authentication, is performed at the remote endpoint."
          },
          {
            "key": "stateful_session_management_authentication",
            "title": "If stateful session management is used, the remote endpoint uses randomly generated session identifiers to authenticate client requests without sending the user's credentials."
          },
          {
            "key": "stateless_token_based_management_authentication",
            "title": "If stateless token-based authentication is used, the server provides a token that has been signed using a secure algorithm."
          },
          {
            "key": "remote_endpoint_terminate",
            "title": "The remote endpoint terminates the existing session when the user logs out."
          },
          {
            "key": "password_policy_exists",
            "title": "A password policy exists and is enforced at the remote endpoint."
          },
          {
            "key": "remote_endpoint_implementation_mechanism",
            "title": "The remote endpoint implements a mechanism to protect against the submission of credentials an excessive number of times."
          },
          {
            "key": "session_invalidated_at_remote_endpoint",,
            "title": "Sessions are invalidated at the remote endpoint after a predefined period of inactivity and access tokens expire."
          },
          {
            "key": "biometric_authentication",
            "title": "Biometric authentication, if any, is not event-bound (i.e. using an API that simply returns 'true' or 'false'). Instead, it is based on unlocking the keychain/keystore."
          },
          {
            "key": "second_factor_authentication",
            "title": "A second factor of authentication exists at the remote endpoint and the 2FA requirement is consistently enforced."
          },
          {
            "key": "sensitive_transaction_setup_authentication",
            "title": "Sensitive transactions require step-up authentication."
          },
          {
            "key": "inform_user_login_activities",
            "title": "The app informs the user of all login activities with their account. Users are able view a list of devices used to access the account, and to block specific devices."
          }
        ]
      }
    ]
  }
}
